gpu_chemistry/cases/shearLayer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField  #codeStream
{

    code
    #{

        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        const vectorField& CC = mesh.C(); //cell center


        scalarField T(mesh.nCells());
        scalar T_i = 900;

        scalar A = 500;
        scalar L = 0.008;
        scalar ro = 0.0004;
        scalar B = 5;



        forAll(CC,cellI)
        {


        	scalar y = CC[cellI].y();

            T[cellI] = T_i - A * 0.5 * (1-tanh(B*(mag(y-L/2)/ro - ro/mag(y-L/2))));


        }

        writeEntry(os,"",T);
    #};

    //! Optional:
    codeInclude
    #{
        #include "volFields.H"
    #};


    codeOptions
    #{

        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude

    #};


    //! libs:

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

};

boundaryField
{

    upperBoundary
    {
        type            cyclic;
    }

    lowerBoundary
    {
        type            cyclic;
    }

    leftBoundary
    {
        type            cyclic;
    }

    rightBoundary
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
